# Pandas Data Structures
### Import Modules

In [1]:
import pandas as pd

## <center>Series 101</center>

### Create a series of teh number of floodingReports

In [4]:
floodingReports = pd.Series([5,6,2,9,12])
floodingReports

0     5
1     6
2     2
3     9
4    12
dtype: int64

### Set county names to be the index of the floodingReports series

In [7]:
floodingReports = pd.Series([5, 6, 2, 9, 12], index=['Cochise County', 'Pima County',
                                                     'Santa Cruz County', 'Maricopa County', 'Yuma County'])
floodingReports

Cochise County        5
Pima County           6
Santa Cruz County     2
Maricopa County       9
Yuma County          12
dtype: int64

### View the number of floodingReports in Cochise County

In [8]:
floodingReports['Cochise County']

5

### View the counties with more than 6 flooding reports

In [11]:
floodingReports[floodingReports > 6]

Maricopa County     9
Yuma County        12
dtype: int64

### Create a pandas series from a dictionary

In [16]:
# Create a dictionary
fireReports_dict = {'Cochise County': 12, 'Pima County': 342, 
                    'Santa Cruz County': 13, 'Maricopa County': 42, 
                    'Yuma County' : 52}

# Convert the dictionary into a pd.Series, and view it
fireReports = pd.Series(fireReports_dict); fireReports

Cochise County        12
Maricopa County       42
Pima County          342
Santa Cruz County     13
Yuma County           52
dtype: int64

### Change the index of a series to shorter names

In [18]:
fireReports.index = ["Cochice", "Pima", "Santa Cruz", "Maricopa", "Yuma"]
fireReports

Cochice        12
Pima           42
Santa Cruz    342
Maricopa       13
Yuma           52
dtype: int64

## <center>DataFrame 101 </center>

### Create a dataframe from a dict of equal length lists or numpy arrays

In [21]:
data = {'county': ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3]}
df = pd.DataFrame(data)
df

       county  reports  year
0     Cochice        4  2012
1        Pima       24  2012
2  Santa Cruz       31  2013
3    Maricopa        2  2014
4        Yuma        3  2014

### Set the order of the columns using the columns attribute

In [22]:
dfColumnOrdered = pd.DataFrame(data, columns =['country', 'year', 'reports'])
dfColumnOrdered

  country  year  reports
0     NaN  2012        4
1     NaN  2012       24
2     NaN  2013       31
3     NaN  2014        2
4     NaN  2014        3

### Add a column

In [26]:
dfColumnOrdered['newsCoverage'] = pd.Series([42.3, 92.1, 12.2, 39.2, 30.2])
dfColumnOrdered

  country  year  reports  newsCoverage
0     NaN  2012        4          42.3
1     NaN  2012       24          92.1
2     NaN  2013       31          12.2
3     NaN  2014        2          39.2
4     NaN  2014        3          30.2

### Delete a column

In [25]:
del dfColumnOrdered['newsCoverage']
dfColumnOrdered

  country  year  reports
0     NaN  2012        4
1     NaN  2012       24
2     NaN  2013       31
3     NaN  2014        2
4     NaN  2014        3

### Transpose the dataframe

In [27]:
dfColumnOrdered.T

                 0     1     2     3     4
country        NaN   NaN   NaN   NaN   NaN
year          2012  2012  2013  2014  2014
reports          4    24    31     2     3
newsCoverage  42.3  92.1  12.2  39.2  30.2

Source: https://chrisalbon.com/python/pandas_data_structures.html